---
type: BRepBuilderPersistentIds
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# BRepBuilderPersistentIds

`Autodesk.Revit.DB.BRepBuilderPersistentIds` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BRepBuilderPersistentIds | 2022 | `public BRepBuilderPersistentIds ( BRepBuilder bRepBuilder )` |
| Method | AddSubTag | 2022 | `public void AddSubTag ( ExternalGeometryId externalGeometryId , BRepBuilderGeometryId brepBuilderGeometryId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsAssociatedBRepBuilderValid | 2022 | `public bool IsAssociatedBRepBuilderValid ()` |
| Method | IsBRepBuilderGeometryIdFaceOrEdge | 2022 | `public bool IsBRepBuilderGeometryIdFaceOrEdge ( BRepBuilderGeometryId brepBuilderGeometryId )` |
| Method | IsValidBRepBuilderGeometryIdForNewCorrespondence | 2022 | `public bool IsValidBRepBuilderGeometryIdForNewCorrespondence ( BRepBuilderGeometryId brepBuilderGeometryId )` |
| Method | IsValidExternalGeometryIdForNewCorrespondence | 2022 | `public bool IsValidExternalGeometryIdForNewCorrespondence ( ExternalGeometryId externalGeometryId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |